app/views/pcb_pricings/_form.html.erb

SELECT `layerthicknesses`.* FROM `layerthicknesses`
---
      <div class="col-sm-8 col-sm-offset-2">
        <%= f.collection_select :layerthickness_id, Layerthickness.all, :id, :thickness %>