app/views/orders/_form.html.erb

SELECT  `layers`.* FROM `layers`  ORDER BY `layers`.`id` ASC LIMIT 1
---
        <div class="col-sm-8 col-sm-offset-2">
          <%= f.collection_select :layer_id, Layer.all, :id, :layercount%>

SELECT `layerthicknesses`.* FROM `layerthicknesses` WHERE `layerthicknesses`.`layer_id` = NULL
---
        <div class="col-sm-8 col-sm-offset-2">
          <%= f.collection_select :layerthickness_id, Layerthickness.where(layer_id: :layer_id), :id, :thickness %>