app/views/layerthicknesses/_form.html.erb

      <div class="col-sm-8 col-sm-offset-2">
        <%= f.collection_select :layer_id, Layer.all, :id, :layercount%>
---
SELECT `layers`.* FROM `layers`