app/controllers/layers_controller.rb

  def index
    @layers = Layer.all
---
SELECT `layers`.* FROM `layers`

  def create
    @layer = Layer.new(layer_params)

    if @layer.save
---
INSERT INTO `layers` (`layercount`, `created_at`, `updated_at`) VALUES (4, '2020-06-24 12:56:11', '2020-06-24 12:56:11')

  def destroy
    @layer.destroy
---
DELETE FROM `layers` WHERE `layers`.`id` = 2

    def set_layer
      @layer = Layer.find(params[:id])
---
SELECT  `layers`.* FROM `layers` WHERE `layers`.`id` = 2 LIMIT 1