app/controllers/layerthicknesses_controller.rb

  def index
    @layerthicknesses = Layerthickness.all
---
SELECT `layerthicknesses`.* FROM `layerthicknesses`

  def create
    @layerthickness = Layerthickness.new(layerthickness_params)

    if @layerthickness.save
---
INSERT INTO `layerthicknesses` (`thickness`, `layer_id`, `created_at`, `updated_at`) VALUES (4.6, 1, '2020-06-26 06:09:32', '2020-06-26 06:09:32')

  def destroy
    @layerthickness.destroy
---
DELETE FROM `layerthicknesses` WHERE `layerthicknesses`.`id` = 5

    def set_layerthickness
      @layerthickness = Layerthickness.find(params[:id])
---
SELECT  `layerthicknesses`.* FROM `layerthicknesses` WHERE `layerthicknesses`.`id` = 5 LIMIT 1