app/controllers/orders_controller.rb

  def index
    if current_user.is_admin == false
      @orders = Order.where(user_id: current_user.id)
    else
      @pagy, @orders = pagy(Order.all, items: 5)
---
SELECT  `orders`.* FROM `orders` WHERE `orders`.`user_id` = 2 LIMIT 1
SELECT `orders`.* FROM `orders`

  def new
    @order = Order.new
    @order.layer_id = Layer.first.id
    @order.quantity = 10
    @order.board_size_y = 10
    @order.board_size_x = 10
    @filtered_thicknesses = Layerthickness.where(layer_id: @order.layer_id)

    pcbPrice = PcbPricing.where(layerthickness_id: @filtered_thicknesses[0].id)
---
SELECT  `layers`.* FROM `layers`  ORDER BY `layers`.`id` ASC LIMIT 1
SELECT `layerthicknesses`.* FROM `layerthicknesses` WHERE `layerthicknesses`.`layer_id` = NULL
SELECT `pcb_pricings`.* FROM `pcb_pricings` WHERE `pcb_pricings`.`layerthickness_id` IS NULL

  def edit
    @filtered_thicknesses = Layerthickness.where(layer_id: 1)
---
SELECT `layerthicknesses`.* FROM `layerthicknesses` WHERE `layerthicknesses`.`layer_id` = NULL

  def create

    @order = Order.new(order_params)
    pcbPrice = PcbPricing.where(layerthickness_id: params[:order][:layerthickness_id])
    @order.pcb_pricing_id = pcbPrice[0].id
    @order.user = current_user
    if @order.save
---
SELECT `pcb_pricings`.* FROM `pcb_pricings` WHERE `pcb_pricings`.`layerthickness_id` IS NULL
INSERT INTO `orders` (`pcb_price`, `shipment_charge`, `tax`, `total_price`, `status`, `pcb_pricing_id`, `user_id`, `created_at`, `updated_at`) VALUES (8000.0, 50.0, 15.0, 8065.0, 'CREATED', 3, 2, '2020-06-29 07:57:00', '2020-06-29 07:57:00')

  def calculate_order
    pcbPrice = PcbPricing.where(layerthickness_id: params[:selected_layerthickness_id])
---
SELECT `pcb_pricings`.`id` FROM `pcb_pricings` WHERE `pcb_pricings`.`layerthickness_id` = 7

  def destroy
    @order.destroy
---
DELETE FROM `orders` WHERE `orders`.`id` = 1

  def filter_thicknesses_by_layer
    @filtered_thicknesses = Layerthickness.where(layer_id: params[:selected_layer])
---
SELECT `layerthicknesses`.* FROM `layerthicknesses` WHERE `layerthicknesses`.`layer_id` = 1