app/controllers/pcb_pricings_controller.rb

SELECT `pcb_pricings`.* FROM `pcb_pricings`
---
  def index
    @pcb_pricings = PcbPricing.all

INSERT INTO `pcb_pricings` (`quantity_from`, `quantity_to`, `price_per_unit_sq_cm`, `layerthickness_id`, `created_at`, `updated_at`) VALUES (0.0, 100.0, 10.0, 7, '2020-06-26 09:23:53', '2020-06-26 09:23:53')
---
  def create
    @pcb_pricing = PcbPricing.new(pcb_pricing_params)

    if @pcb_pricing.save

DELETE FROM `pcb_pricings` WHERE `pcb_pricings`.`id` = 1
---
  def destroy
    @pcb_pricing.destroy

SELECT  `pcb_pricings`.* FROM `pcb_pricings` WHERE `pcb_pricings`.`id` = 2 LIMIT 1
---
    def set_pcb_pricing
      @pcb_pricing = PcbPricing.find(params[:id])