app/controllers/users_controller.rb

  def create
    @user = User.new(users_params)
    @user.is_admin = false
    if @user.save
---
INSERT INTO `users` (`email`, `password_digest`, `is_admin`, `created_at`, `updated_at`) VALUES ('raghu@gmail.com', '$2a$12$AWwDAdKH6eGaaNUXv9tk4eUQPy.8MBidzDU/nX4eR41CT6MOi9uVa', 0, '2020-06-30 18:59:24', '2020-06-30 18:59:24')